zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief E0FC, CPUx Safety Protection SPR Region Read Access Enable Register B7 */
#define CPU0_SPR_SPROT_RGNACCENB_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF880E0FCu)
/** Alias (User Manual Name) for CPU0_SPR_SPROT_RGNACCENB_R7.
* To use register names with standard convension, please use CPU0_SPR_SPROT_RGNACCENB_R7.
*/
#define CPU0_SPR_SPROT_RGNACCENB7_R (CPU0_SPR_SPROT_RGNACCENB_R7)

/** \brief E100, CPUx Safety Protection Register Access Enable Register A */
#define CPU0_SFR_SPROT_ACCENA_W /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SFR_SPROT_ACCENA_W*)0xF880E100u)

/** \brief E104, CPUx Safety Protection Region Access Enable Register B */
#define CPU0_SFR_SPROT_ACCENB_W /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SFR_SPROT_ACCENB_W*)0xF880E104u)

/** \brief E110, CPUx Safety Protection Region LPB Read Access Enable Register A */
#define CPU0_LPB_SPROT_ACCENA_R /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENA_R*)0xF880E110u)

/** \brief E114, CPUx Safety Protection Region LPB Read Access Enable Register B */
#define CPU0_LPB_SPROT_ACCENB_R /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENB_R*)0xF880E114u)

/** \brief E200, CPUx Safety Protection DLMU Region Lower Address Register 0 */
#define CPU0_DLMU_SPROT_RGNLA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF880E200u)

/** \brief E204, CPUx Safety protection DLMU Region Upper Address Register 0 */
#define CPU0_DLMU_SPROT_RGNUA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF880E204u)

/** \brief E208, CPUx Safety Protection Region DLMU Write Access Enable Register A0 */
#define CPU0_DLMU_SPROT_RGNACCENA_W0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF880E208u)
/** Alias (User Manual Name) for CPU0_DLMU_SPROT_RGNACCENA_W0.
* To use register names with standard convension, please use CPU0_DLMU_SPROT_RGNACCENA_W0.
*/
#define CPU0_DLMU_SPROT_RGNACCENA0_W (CPU0_DLMU_SPROT_RGNACCENA_W0)

/** \brief E20C, CPUx Safety Protection Region DLMU Write Access Enable Register B0 */
#define CPU0_DLMU_SPROT_RGNACCENB_W0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF880E20Cu)
/** Alias (User Manual Name) for CPU0_DLMU_SPROT_RGNACCENB_W0.
* To use register names with standard convension, please use CPU0_DLMU_SPROT_RGNACCENB_W0.
*/
#define CPU0_DLMU_SPROT_RGNACCENB0_W (CPU0_DLMU_SPROT_RGNACCENB_W0)

/** \brief E210, CPUx Safety Protection DLMU Region Lower Address Register 1 */
#define CPU0_DLMU_SPROT_RGNLA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF880E210u)

/** \brief E214, CPUx Safety protection DLMU Region Upper Address Register 1 */
#define CPU0_DLMU_SPROT_RGNUA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF880E214u)

/** \brief E218, CPUx Safety Protection Region DLMU Write Access Enable Register A1 */
#define CPU0_DLMU_SPROT_RGNACCENA_W1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF880E218u)
/** Alias (User Manual Name) for CPU0_DLMU_SPROT_RGNACCENA_W1.
* To use register names with standard convension, please use CPU0_DLMU_SPROT_RGNACCENA_W1.
*/
#define CPU0_DLMU_SPROT_RGNACCENA1_W (CPU0_DLMU_SPROT_RGNACCENA_W1)

/** \brief E21C, CPUx Safety Protection Region DLMU Write Access Enable Register B1 */
#define CPU0_DLMU_SPROT_RGNACCENB_W1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF880E21Cu)
/** Alias (User Manual Name) for CPU0_DLMU_SPROT_RGNACCENB_W1.
* To use register names with standard convension, please use CPU0_DLMU_SPROT_RGNACCENB_W1.
*/
#define CPU0_DLMU_SPROT_RGNACCENB1_W (CPU0_DLMU_SPROT_RGNACCENB_W1)

/** \brief E220, CPUx Safety Protection DLMU Region Lower Address Register 2 */
#define CPU0_DLMU_SPROT_RGNLA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF880E220u)

/** \brief E224, CPUx Safety protection DLMU Region Upper Address Register 2 */
#define CPU0_DLMU_SPROT_RGNUA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF880E224u)

/** \brief E228, CPUx Safety Protection Region DLMU Write Access Enable Register A2 */
#define CPU0_DLMU_SPROT_RGNACCENA_W2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF880E228u)
/** Alias (User Manual Name) for CPU0_DLMU_SPROT_RGNACCENA_W2.
* To use register names with standard convension, please use CPU0_DLMU_SPROT_RGNACCENA_W2.
*/
#define CPU0_DLMU_SPROT_RGNACCENA2_W (CPU0_DLMU_SPROT_RGNACCENA_W2)

/** \brief E22C, CPUx Safety Protection Region DLMU Write Access Enable Register B2 */
#define CPU0_DLMU_SPROT_RGNACCENB_W2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF880E22Cu)
/** Alias (User Manual Name) for CPU0_DLMU_SPROT_RGNACCENB_W2.
* To use register names with standard convension, please use CPU0_DLMU_SPROT_RGNACCENB_W2.
*/
#define CPU0_DLMU_SPROT_RGNACCENB2_W (CPU0_DLMU_SPROT_RGNACCENB_W2)

/** \brief E230, CPUx Safety Protection DLMU Region Lower Address Register 3 */
#define CPU0_DLMU_SPROT_RGNLA3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF880E230u)

/** \brief E234, CPUx Safety protection DLMU Region Upper Address Register 3 */
#define CPU0_DLMU_SPROT_RGNUA3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF880E234u)

/** \brief E238, CPUx Safety Protection Region DLMU Write Access Enable Register A3 */
#define CPU0_DLMU_SPROT_RGNACCENA_W3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF880E238u)
/** Alias (User Manual Name) for CPU0_DLMU_SPROT_RGNACCENA_W3.
* To use register names with standard convension, please use CPU0_DLMU_SPROT_RGNACCENA_W3.
*/
#define CPU0_DLMU_SPROT_RGNACCENA3_W (CPU0_DLMU_SPROT_RGNACCENA_W3)

/** \brief E23C, CPUx Safety Protection Region DLMU Write Access Enable Register B3 */
#define CPU0_DLMU_SPROT_RGNACCENB_W3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF880E23Cu)
/** Alias (User Manual Name) for CPU0_DLMU_SPROT_RGNACCENB_W3.
* To use register names with standard convension, please use CPU0_DLMU_SPROT_RGNACCENB_W3.
*/
#define CPU0_DLMU_SPROT_RGNACCENB3_W (CPU0_DLMU_SPROT_RGNACCENB_W3)

/** \brief E240, CPUx Safety Protection DLMU Region Lower Address Register 4 */
#define CPU0_DLMU_SPROT_RGNLA4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF880E240u)

/** \brief E244, CPUx Safety protection DLMU Region Upper Address Register 4 */
#define CPU0_DLMU_SPROT_RGNUA4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF880E244u)

/** \brief E248, CPUx Safety Protection Region DLMU Write Access Enable Register A4 */
#define CPU0_DLMU_SPROT_RGNACCENA_W4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF880E248u)
/** Alias (User Manual Name) for CPU0_DLMU_SPROT_RGNACCENA_W4.
* To use register names with standard convension, please use CPU0_DLMU_SPROT_RGNACCENA_W4.
*/
#define CPU0_DLMU_SPROT_RGNACCENA4_W (CPU0_DLMU_SPROT_RGNACCENA_W4)

/** \brief E24C, CPUx Safety Protection Region DLMU Write Access Enable Register B4 */
#define CPU0_DLMU_SPROT_RGNACCENB_W4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF880E24Cu)
/** Alias (User Manual Name) for CPU0_DLMU_SPROT_RGNACCENB_W4.
* To use register names with standard convension, please use CPU0_DLMU_SPROT_RGNACCENB_W4.
*/
#define CPU0_DLMU_SPROT_RGNACCENB4_W (CPU0_DLMU_SPROT_RGNACCENB_W4)

/** \brief E250, CPUx Safety Protection DLMU Region Lower Address Register 5 */
#define CPU0_DLMU_SPROT_RGNLA5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF880E250u)

