zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief E004, CPUx Code Protection Execute Enable Register Set 1 */
#define CPU0_CPXE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF881E004u)

/** \brief E008, CPUx Code Protection Execute Enable Register Set 2 */
#define CPU0_CPXE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF881E008u)

/** \brief E00C, CPUx Code Protection Execute Enable Register Set 3 */
#define CPU0_CPXE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF881E00Cu)

/** \brief E010, CPUx Data Protection Read Enable Register Set 0 */
#define CPU0_DPRE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF881E010u)

/** \brief E014, CPUx Data Protection Read Enable Register Set 1 */
#define CPU0_DPRE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF881E014u)

/** \brief E018, CPUx Data Protection Read Enable Register Set 2 */
#define CPU0_DPRE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF881E018u)

/** \brief E01C, CPUx Data Protection Read Enable Register Set 3 */
#define CPU0_DPRE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF881E01Cu)

/** \brief E020, CPUx Data Protection Write Enable Register Set 0 */
#define CPU0_DPWE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF881E020u)

/** \brief E024, CPUx Data Protection Write Enable Register Set 1 */
#define CPU0_DPWE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF881E024u)

/** \brief E028, CPUx Data Protection Write Enable Register Set 2 */
#define CPU0_DPWE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF881E028u)

/** \brief E02C, CPUx Data Protection Write Enable Register Set 3 */
#define CPU0_DPWE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF881E02Cu)

/** \brief E040, CPUx Code Protection Execute Enable Register Set 4 */
#define CPU0_CPXE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF881E040u)

/** \brief E044, CPUx Code Protection Execute Enable Register Set 5 */
#define CPU0_CPXE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF881E044u)

/** \brief E050, CPUx Data Protection Read Enable Register Set 4 */
#define CPU0_DPRE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF881E050u)

/** \brief E054, CPUx Data Protection Read Enable Register Set 5 */
#define CPU0_DPRE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF881E054u)

/** \brief E060, CPUx Data Protection Write Enable Register Set 4 */
#define CPU0_DPWE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF881E060u)

/** \brief E064, CPUx Data Protection Write Enable Register Set 5 */
#define CPU0_DPWE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF881E064u)

/** \brief E400, CPUx Temporal Protection System Control Register */
#define CPU0_TPS_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_CON*)0xF881E400u)

/** \brief E404, CPUx Temporal Protection System Timer Register 0 */
#define CPU0_TPS_TIMER0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF881E404u)

/** \brief E408, CPUx Temporal Protection System Timer Register 1 */
#define CPU0_TPS_TIMER1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF881E408u)

/** \brief E40C, CPUx Temporal Protection System Timer Register 2 */
#define CPU0_TPS_TIMER2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF881E40Cu)

/** \brief E440, CPUx Exception Entry Timer Load Value */
#define CPU0_TPS_EXTIM_ENTRY_LVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_ENTRY_LVAL*)0xF881E440u)

/** \brief E444, CPUx Exception Entry Timer Current Value */
#define CPU0_TPS_EXTIM_ENTRY_CVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_ENTRY_CVAL*)0xF881E444u)

/** \brief E448, CPUx Exception Exit  Timer Load Value */
#define CPU0_TPS_EXTIM_EXIT_LVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_EXIT_LVAL*)0xF881E448u)

/** \brief E44C, CPUx Exception Exit Timer Current Value */
#define CPU0_TPS_EXTIM_EXIT_CVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_EXIT_CVAL*)0xF881E44Cu)

/** \brief E450, CPUx Exception Timer Class Enable Register */
#define CPU0_TPS_EXTIM_CLASS_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_CLASS_EN*)0xF881E450u)

/** \brief E454, CPUx Exception Timer Status Register */
#define CPU0_TPS_EXTIM_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_STAT*)0xF881E454u)

/** \brief E458, CPUx Exception Timer FCX Register */
#define CPU0_TPS_EXTIM_FCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_FCX*)0xF881E458u)

/** \brief F000, CPUx Trigger Event 0 */
#define CPU0_TR0_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F000u)
/** Alias (User Manual Name) for CPU0_TR0_EVT.
* To use register names with standard convension, please use CPU0_TR0_EVT.
*/
#define CPU0_TR0EVT (CPU0_TR0_EVT)

/** \brief F004, CPUx Trigger Address 0 */
#define CPU0_TR0_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F004u)
/** Alias (User Manual Name) for CPU0_TR0_ADR.
* To use register names with standard convension, please use CPU0_TR0_ADR.
*/
#define CPU0_TR0ADR (CPU0_TR0_ADR)

/** \brief F008, CPUx Trigger Event 1 */
#define CPU0_TR1_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F008u)
/** Alias (User Manual Name) for CPU0_TR1_EVT.
* To use register names with standard convension, please use CPU0_TR1_EVT.
*/
#define CPU0_TR1EVT (CPU0_TR1_EVT)

/** \brief F00C, CPUx Trigger Address 1 */
#define CPU0_TR1_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F00Cu)
/** Alias (User Manual Name) for CPU0_TR1_ADR.
* To use register names with standard convension, please use CPU0_TR1_ADR.
*/
#define CPU0_TR1ADR (CPU0_TR1_ADR)

/** \brief F010, CPUx Trigger Event 2 */
#define CPU0_TR2_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F010u)
/** Alias (User Manual Name) for CPU0_TR2_EVT.
* To use register names with standard convension, please use CPU0_TR2_EVT.
*/
#define CPU0_TR2EVT (CPU0_TR2_EVT)

/** \brief F014, CPUx Trigger Address 2 */
#define CPU0_TR2_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F014u)
/** Alias (User Manual Name) for CPU0_TR2_ADR.
* To use register names with standard convension, please use CPU0_TR2_ADR.
*/
#define CPU0_TR2ADR (CPU0_TR2_ADR)

