zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief F018, CPUx Trigger Event 3 */
#define CPU2_TR3_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F018u)
/** Alias (User Manual Name) for CPU2_TR3_EVT.
* To use register names with standard convension, please use CPU2_TR3_EVT.
*/
#define CPU2_TR3EVT (CPU2_TR3_EVT)

/** \brief F01C, CPUx Trigger Address 3 */
#define CPU2_TR3_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F01Cu)
/** Alias (User Manual Name) for CPU2_TR3_ADR.
* To use register names with standard convension, please use CPU2_TR3_ADR.
*/
#define CPU2_TR3ADR (CPU2_TR3_ADR)

/** \brief F020, CPUx Trigger Event 4 */
#define CPU2_TR4_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F020u)
/** Alias (User Manual Name) for CPU2_TR4_EVT.
* To use register names with standard convension, please use CPU2_TR4_EVT.
*/
#define CPU2_TR4EVT (CPU2_TR4_EVT)

/** \brief F024, CPUx Trigger Address 4 */
#define CPU2_TR4_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F024u)
/** Alias (User Manual Name) for CPU2_TR4_ADR.
* To use register names with standard convension, please use CPU2_TR4_ADR.
*/
#define CPU2_TR4ADR (CPU2_TR4_ADR)

/** \brief F028, CPUx Trigger Event 5 */
#define CPU2_TR5_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F028u)
/** Alias (User Manual Name) for CPU2_TR5_EVT.
* To use register names with standard convension, please use CPU2_TR5_EVT.
*/
#define CPU2_TR5EVT (CPU2_TR5_EVT)

/** \brief F02C, CPUx Trigger Address 5 */
#define CPU2_TR5_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F02Cu)
/** Alias (User Manual Name) for CPU2_TR5_ADR.
* To use register names with standard convension, please use CPU2_TR5_ADR.
*/
#define CPU2_TR5ADR (CPU2_TR5_ADR)

/** \brief F030, CPUx Trigger Event 6 */
#define CPU2_TR6_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F030u)
/** Alias (User Manual Name) for CPU2_TR6_EVT.
* To use register names with standard convension, please use CPU2_TR6_EVT.
*/
#define CPU2_TR6EVT (CPU2_TR6_EVT)

/** \brief F034, CPUx Trigger Address 6 */
#define CPU2_TR6_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F034u)
/** Alias (User Manual Name) for CPU2_TR6_ADR.
* To use register names with standard convension, please use CPU2_TR6_ADR.
*/
#define CPU2_TR6ADR (CPU2_TR6_ADR)

/** \brief F038, CPUx Trigger Event 7 */
#define CPU2_TR7_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F038u)
/** Alias (User Manual Name) for CPU2_TR7_EVT.
* To use register names with standard convension, please use CPU2_TR7_EVT.
*/
#define CPU2_TR7EVT (CPU2_TR7_EVT)

/** \brief F03C, CPUx Trigger Address 7 */
#define CPU2_TR7_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F03Cu)
/** Alias (User Manual Name) for CPU2_TR7_ADR.
* To use register names with standard convension, please use CPU2_TR7_ADR.
*/
#define CPU2_TR7ADR (CPU2_TR7_ADR)

/** \brief FC00, CPUx Counter Control */
#define CPU2_CCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CCTRL*)0xF885FC00u)

/** \brief FC04, CPUx CPU Clock Cycle Count */
#define CPU2_CCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CCNT*)0xF885FC04u)

/** \brief FC08, CPUx Instruction Count */
#define CPU2_ICNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ICNT*)0xF885FC08u)

/** \brief FC0C, CPUx Multi-Count Register 1 */
#define CPU2_M1CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M1CNT*)0xF885FC0Cu)

/** \brief FC10, CPUx Multi-Count Register 2 */
#define CPU2_M2CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M2CNT*)0xF885FC10u)

/** \brief FC14, CPUx Multi-Count Register 3 */
#define CPU2_M3CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M3CNT*)0xF885FC14u)

/** \brief FD00, CPUx Debug Status Register */
#define CPU2_DBGSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DBGSR*)0xF885FD00u)

/** \brief FD08, CPUx External Event Register */
#define CPU2_EXEVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_EXEVT*)0xF885FD08u)

/** \brief FD0C, CPUx Core Register Access Event */
#define CPU2_CREVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CREVT*)0xF885FD0Cu)

/** \brief FD10, CPUx Software Debug Event */
#define CPU2_SWEVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SWEVT*)0xF885FD10u)

/** \brief FD30, CPUx TriggerAddressx */
#define CPU2_TRIG_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TRIG_ACC*)0xF885FD30u)

/** \brief FD40, CPUx Debug Monitor Start Address */
#define CPU2_DMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DMS*)0xF885FD40u)

/** \brief FD44, CPUx Debug Context Save Area Pointer */
#define CPU2_DCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DCX*)0xF885FD44u)

/** \brief FD48, CPUx Debug Trap Control Register */
#define CPU2_DBGTCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF885FD48u)

/** \brief FE00, CPUx Previous Context Information Register */
#define CPU2_PCXI /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCXI*)0xF885FE00u)

/** \brief FE04, CPUx Program Status Word */
#define CPU2_PSW /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PSW*)0xF885FE04u)

/** \brief FE08, CPUx Program Counter */
#define CPU2_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PC*)0xF885FE08u)

/** \brief FE14, CPUx System Configuration Register */
#define CPU2_SYSCON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SYSCON*)0xF885FE14u)

/** \brief FE18, CPUx Identification Register TC1.6.2P */
#define CPU2_CPU_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF885FE18u)

/** \brief FE1C, CPUx Core Identification Register */
#define CPU2_CORE_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF885FE1Cu)

/** \brief FE20, CPUx Base Interrupt Vector Table Pointer */
#define CPU2_BIV /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BIV*)0xF885FE20u)

/** \brief FE24, CPUx Base Trap Vector Table Pointer */
#define CPU2_BTV /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BTV*)0xF885FE24u)

/** \brief FE28, CPUx Interrupt Stack Pointer */
#define CPU2_ISP /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ISP*)0xF885FE28u)

/** \brief FE2C, CPUx Interrupt Control Register */
#define CPU2_ICR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ICR*)0xF885FE2Cu)

/** \brief FE38, CPUx Free CSA List Head Pointer */
#define CPU2_FCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FCX*)0xF885FE38u)

/** \brief FE3C, CPUx Free CSA List Limit Pointer */
#define CPU2_LCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_LCX*)0xF885FE3Cu)

/** \brief FE50, CPUx Customer ID register */
#define CPU2_CUS_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF885FE50u)

/** \brief FF00, CPUx Data General Purpose Register 0 */
#define CPU2_D0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF00u)

