zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief E004, CPUx Code Protection Execute Enable Register Set 1 */
#define CPU3_CPXE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF887E004u)

/** \brief E008, CPUx Code Protection Execute Enable Register Set 2 */
#define CPU3_CPXE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF887E008u)

/** \brief E00C, CPUx Code Protection Execute Enable Register Set 3 */
#define CPU3_CPXE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF887E00Cu)

/** \brief E010, CPUx Data Protection Read Enable Register Set 0 */
#define CPU3_DPRE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF887E010u)

/** \brief E014, CPUx Data Protection Read Enable Register Set 1 */
#define CPU3_DPRE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF887E014u)

/** \brief E018, CPUx Data Protection Read Enable Register Set 2 */
#define CPU3_DPRE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF887E018u)

/** \brief E01C, CPUx Data Protection Read Enable Register Set 3 */
#define CPU3_DPRE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF887E01Cu)

/** \brief E020, CPUx Data Protection Write Enable Register Set 0 */
#define CPU3_DPWE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF887E020u)

/** \brief E024, CPUx Data Protection Write Enable Register Set 1 */
#define CPU3_DPWE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF887E024u)

/** \brief E028, CPUx Data Protection Write Enable Register Set 2 */
#define CPU3_DPWE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF887E028u)

/** \brief E02C, CPUx Data Protection Write Enable Register Set 3 */
#define CPU3_DPWE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF887E02Cu)

/** \brief E040, CPUx Code Protection Execute Enable Register Set 4 */
#define CPU3_CPXE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF887E040u)

/** \brief E044, CPUx Code Protection Execute Enable Register Set 5 */
#define CPU3_CPXE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF887E044u)

/** \brief E050, CPUx Data Protection Read Enable Register Set 4 */
#define CPU3_DPRE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF887E050u)

/** \brief E054, CPUx Data Protection Read Enable Register Set 5 */
#define CPU3_DPRE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF887E054u)

/** \brief E060, CPUx Data Protection Write Enable Register Set 4 */
#define CPU3_DPWE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF887E060u)

/** \brief E064, CPUx Data Protection Write Enable Register Set 5 */
#define CPU3_DPWE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF887E064u)

/** \brief E400, CPUx Temporal Protection System Control Register */
#define CPU3_TPS_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_CON*)0xF887E400u)

/** \brief E404, CPUx Temporal Protection System Timer Register 0 */
#define CPU3_TPS_TIMER0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF887E404u)

/** \brief E408, CPUx Temporal Protection System Timer Register 1 */
#define CPU3_TPS_TIMER1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF887E408u)

/** \brief E40C, CPUx Temporal Protection System Timer Register 2 */
#define CPU3_TPS_TIMER2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF887E40Cu)

/** \brief E440, CPUx Exception Entry Timer Load Value */
#define CPU3_TPS_EXTIM_ENTRY_LVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_ENTRY_LVAL*)0xF887E440u)

/** \brief E444, CPUx Exception Entry Timer Current Value */
#define CPU3_TPS_EXTIM_ENTRY_CVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_ENTRY_CVAL*)0xF887E444u)

/** \brief E448, CPUx Exception Exit  Timer Load Value */
#define CPU3_TPS_EXTIM_EXIT_LVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_EXIT_LVAL*)0xF887E448u)

/** \brief E44C, CPUx Exception Exit Timer Current Value */
#define CPU3_TPS_EXTIM_EXIT_CVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_EXIT_CVAL*)0xF887E44Cu)

/** \brief E450, CPUx Exception Timer Class Enable Register */
#define CPU3_TPS_EXTIM_CLASS_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_CLASS_EN*)0xF887E450u)

/** \brief E454, CPUx Exception Timer Status Register */
#define CPU3_TPS_EXTIM_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_STAT*)0xF887E454u)

/** \brief E458, CPUx Exception Timer FCX Register */
#define CPU3_TPS_EXTIM_FCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_FCX*)0xF887E458u)

/** \brief F000, CPUx Trigger Event 0 */
#define CPU3_TR0_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF887F000u)
/** Alias (User Manual Name) for CPU3_TR0_EVT.
* To use register names with standard convension, please use CPU3_TR0_EVT.
*/
#define CPU3_TR0EVT (CPU3_TR0_EVT)

/** \brief F004, CPUx Trigger Address 0 */
#define CPU3_TR0_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF887F004u)
/** Alias (User Manual Name) for CPU3_TR0_ADR.
* To use register names with standard convension, please use CPU3_TR0_ADR.
*/
#define CPU3_TR0ADR (CPU3_TR0_ADR)

/** \brief F008, CPUx Trigger Event 1 */
#define CPU3_TR1_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF887F008u)
/** Alias (User Manual Name) for CPU3_TR1_EVT.
* To use register names with standard convension, please use CPU3_TR1_EVT.
*/
#define CPU3_TR1EVT (CPU3_TR1_EVT)

/** \brief F00C, CPUx Trigger Address 1 */
#define CPU3_TR1_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF887F00Cu)
/** Alias (User Manual Name) for CPU3_TR1_ADR.
* To use register names with standard convension, please use CPU3_TR1_ADR.
*/
#define CPU3_TR1ADR (CPU3_TR1_ADR)

/** \brief F010, CPUx Trigger Event 2 */
#define CPU3_TR2_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF887F010u)
/** Alias (User Manual Name) for CPU3_TR2_EVT.
* To use register names with standard convension, please use CPU3_TR2_EVT.
*/
#define CPU3_TR2EVT (CPU3_TR2_EVT)

/** \brief F014, CPUx Trigger Address 2 */
#define CPU3_TR2_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF887F014u)
/** Alias (User Manual Name) for CPU3_TR2_ADR.
* To use register names with standard convension, please use CPU3_TR2_ADR.
*/
#define CPU3_TR2ADR (CPU3_TR2_ADR)

