zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief FF04, CPUx Data General Purpose Register 1 */
#define CPU3_D1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF04u)

/** \brief FF08, CPUx Data General Purpose Register 2 */
#define CPU3_D2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF08u)

/** \brief FF0C, CPUx Data General Purpose Register 3 */
#define CPU3_D3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF0Cu)

/** \brief FF10, CPUx Data General Purpose Register 4 */
#define CPU3_D4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF10u)

/** \brief FF14, CPUx Data General Purpose Register 5 */
#define CPU3_D5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF14u)

/** \brief FF18, CPUx Data General Purpose Register 6 */
#define CPU3_D6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF18u)

/** \brief FF1C, CPUx Data General Purpose Register 7 */
#define CPU3_D7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF1Cu)

/** \brief FF20, CPUx Data General Purpose Register 8 */
#define CPU3_D8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF20u)

/** \brief FF24, CPUx Data General Purpose Register 9 */
#define CPU3_D9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF24u)

/** \brief FF28, CPUx Data General Purpose Register 10 */
#define CPU3_D10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF28u)

/** \brief FF2C, CPUx Data General Purpose Register 11 */
#define CPU3_D11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF2Cu)

/** \brief FF30, CPUx Data General Purpose Register 12 */
#define CPU3_D12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF30u)

/** \brief FF34, CPUx Data General Purpose Register 13 */
#define CPU3_D13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF34u)

/** \brief FF38, CPUx Data General Purpose Register 14 */
#define CPU3_D14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF38u)

/** \brief FF3C, CPUx Data General Purpose Register 15 */
#define CPU3_D15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF3Cu)

/** \brief FF80, CPUx Address General Purpose Register 0 */
#define CPU3_A0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF80u)

/** \brief FF84, CPUx Address General Purpose Register 1 */
#define CPU3_A1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF84u)

/** \brief FF88, CPUx Address General Purpose Register 2 */
#define CPU3_A2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF88u)

/** \brief FF8C, CPUx Address General Purpose Register 3 */
#define CPU3_A3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF8Cu)

/** \brief FF90, CPUx Address General Purpose Register 4 */
#define CPU3_A4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF90u)

/** \brief FF94, CPUx Address General Purpose Register 5 */
#define CPU3_A5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF94u)

/** \brief FF98, CPUx Address General Purpose Register 6 */
#define CPU3_A6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF98u)

/** \brief FF9C, CPUx Address General Purpose Register 7 */
#define CPU3_A7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF9Cu)

/** \brief FFA0, CPUx Address General Purpose Register 8 */
#define CPU3_A8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFA0u)

/** \brief FFA4, CPUx Address General Purpose Register 9 */
#define CPU3_A9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFA4u)

/** \brief FFA8, CPUx Address General Purpose Register 10 */
#define CPU3_A10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFA8u)

/** \brief FFAC, CPUx Address General Purpose Register 11 */
#define CPU3_A11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFACu)

/** \brief FFB0, CPUx Address General Purpose Register 12 */
#define CPU3_A12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFB0u)

/** \brief FFB4, CPUx Address General Purpose Register 13 */
#define CPU3_A13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFB4u)

/** \brief FFB8, CPUx Address General Purpose Register 14 */
#define CPU3_A14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFB8u)

/** \brief FFBC, CPUx Address General Purpose Register 15 */
#define CPU3_A15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFBCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Cpu_Registers_Cfg_Cpu4
 * \{  */
/** \brief 1100, CPUx Flash Configuration Register 0 */
#define CPU4_FLASHCON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON0*)0xF8881100u)

/** \brief 1104, CPUx Flash Configuration Register 1 */
#define CPU4_FLASHCON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON1*)0xF8881104u)

/** \brief 1108, CPUx Flash Configuration Register 2 */
#define CPU4_FLASHCON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON2*)0xF8881108u)

/** \brief 110C, CPUx Flash Configuration Register 3 */
#define CPU4_FLASHCON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON3*)0xF888110Cu)

/** \brief 1110, CPUx Flash Configuration Register 4 */
#define CPU4_FLASHCON4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON4*)0xF8881110u)

/** \brief D000, CPUx  Reset Register 0 */
#define CPU4_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_KRST0*)0xF888D000u)

/** \brief D004, CPUx  Reset Register 1 */
#define CPU4_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_KRST1*)0xF888D004u)

/** \brief D008, CPUx Reset Clear Register */
#define CPU4_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_KRSTCLR*)0xF888D008u)

/** \brief E000, CPUx Safety Protection SPR Region Lower Address Register 0 */
#define CPU4_RGN0_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF888E000u)
/** Alias (User Manual Name) for CPU4_RGN0_LA.
* To use register names with standard convension, please use CPU4_RGN0_LA.
*/
#define CPU4_SPR_SPROT_RGNLA0 (CPU4_RGN0_LA)

/** \brief E004, CPUx Safety Protection SPR Region Upper Address Register 0 */
#define CPU4_RGN0_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF888E004u)
/** Alias (User Manual Name) for CPU4_RGN0_UA.
* To use register names with standard convension, please use CPU4_RGN0_UA.
*/
#define CPU4_SPR_SPROT_RGNUA0 (CPU4_RGN0_UA)

/** \brief E008, CPUx Safety Protection SPR Region Write Access Enable Register A0 */
#define CPU4_RGN0_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF888E008u)
/** Alias (User Manual Name) for CPU4_RGN0_ACCENA.
* To use register names with standard convension, please use CPU4_RGN0_ACCENA.
*/
#define CPU4_SPR_SPROT_RGNACCENA0_W (CPU4_RGN0_ACCENA)

/** \brief E00C, CPUx Safety Protection SPR Region Write Access Enable Register B0 */
#define CPU4_RGN0_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF888E00Cu)
/** Alias (User Manual Name) for CPU4_RGN0_ACCENB.
* To use register names with standard convension, please use CPU4_RGN0_ACCENB.
*/
#define CPU4_SPR_SPROT_RGNACCENB0_W (CPU4_RGN0_ACCENB)

