zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief E2DC, CPUx Safety Protection Region DLMU Read Access Enable Register B5 */
#define CPU4_DLMU_SPROT_RGNACCENB_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_R*)0xF888E2DCu)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENB_R5.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENB_R5.
*/
#define CPU4_DLMU_SPROT_RGNACCENB5_R (CPU4_DLMU_SPROT_RGNACCENB_R5)

/** \brief E2E8, CPUx Safety Protection Region DLMU Read Access Enable Register A6 */
#define CPU4_DLMU_SPROT_RGNACCENA_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_R*)0xF888E2E8u)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENA_R6.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENA_R6.
*/
#define CPU4_DLMU_SPROT_RGNACCENA6_R (CPU4_DLMU_SPROT_RGNACCENA_R6)

/** \brief E2EC, CPUx Safety Protection Region DLMU Read Access Enable Register B6 */
#define CPU4_DLMU_SPROT_RGNACCENB_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_R*)0xF888E2ECu)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENB_R6.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENB_R6.
*/
#define CPU4_DLMU_SPROT_RGNACCENB6_R (CPU4_DLMU_SPROT_RGNACCENB_R6)

/** \brief E2F8, CPUx Safety Protection Region DLMU Read Access Enable Register A7 */
#define CPU4_DLMU_SPROT_RGNACCENA_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_R*)0xF888E2F8u)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENA_R7.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENA_R7.
*/
#define CPU4_DLMU_SPROT_RGNACCENA7_R (CPU4_DLMU_SPROT_RGNACCENA_R7)

/** \brief E2FC, CPUx Safety Protection Region DLMU Read Access Enable Register B7 */
#define CPU4_DLMU_SPROT_RGNACCENB_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_R*)0xF888E2FCu)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENB_R7.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENB_R7.
*/
#define CPU4_DLMU_SPROT_RGNACCENB7_R (CPU4_DLMU_SPROT_RGNACCENB_R7)

/** \brief FB00, CPUx  Overlay Range Select Register */
#define CPU4_OSEL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_OSEL*)0xF888FB00u)

/** \brief FB10, CPUx Redirected Address Base Register 0 */
#define CPU4_BLK0_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB10u)
/** Alias (User Manual Name) for CPU4_BLK0_RABR.
* To use register names with standard convension, please use CPU4_BLK0_RABR.
*/
#define CPU4_RABR0 (CPU4_BLK0_RABR)

/** \brief FB14, CPUx Overlay Target Address Register 0 */
#define CPU4_BLK0_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB14u)
/** Alias (User Manual Name) for CPU4_BLK0_OTAR.
* To use register names with standard convension, please use CPU4_BLK0_OTAR.
*/
#define CPU4_OTAR0 (CPU4_BLK0_OTAR)

/** \brief FB18, CPUx Overlay Mask Register 0 */
#define CPU4_BLK0_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB18u)
/** Alias (User Manual Name) for CPU4_BLK0_OMASK.
* To use register names with standard convension, please use CPU4_BLK0_OMASK.
*/
#define CPU4_OMASK0 (CPU4_BLK0_OMASK)

/** \brief FB1C, CPUx Redirected Address Base Register 1 */
#define CPU4_BLK1_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB1Cu)
/** Alias (User Manual Name) for CPU4_BLK1_RABR.
* To use register names with standard convension, please use CPU4_BLK1_RABR.
*/
#define CPU4_RABR1 (CPU4_BLK1_RABR)

/** \brief FB20, CPUx Overlay Target Address Register 1 */
#define CPU4_BLK1_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB20u)
/** Alias (User Manual Name) for CPU4_BLK1_OTAR.
* To use register names with standard convension, please use CPU4_BLK1_OTAR.
*/
#define CPU4_OTAR1 (CPU4_BLK1_OTAR)

/** \brief FB24, CPUx Overlay Mask Register 1 */
#define CPU4_BLK1_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB24u)
/** Alias (User Manual Name) for CPU4_BLK1_OMASK.
* To use register names with standard convension, please use CPU4_BLK1_OMASK.
*/
#define CPU4_OMASK1 (CPU4_BLK1_OMASK)

/** \brief FB28, CPUx Redirected Address Base Register 2 */
#define CPU4_BLK2_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB28u)
/** Alias (User Manual Name) for CPU4_BLK2_RABR.
* To use register names with standard convension, please use CPU4_BLK2_RABR.
*/
#define CPU4_RABR2 (CPU4_BLK2_RABR)

/** \brief FB2C, CPUx Overlay Target Address Register 2 */
#define CPU4_BLK2_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB2Cu)
/** Alias (User Manual Name) for CPU4_BLK2_OTAR.
* To use register names with standard convension, please use CPU4_BLK2_OTAR.
*/
#define CPU4_OTAR2 (CPU4_BLK2_OTAR)

/** \brief FB30, CPUx Overlay Mask Register 2 */
#define CPU4_BLK2_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB30u)
/** Alias (User Manual Name) for CPU4_BLK2_OMASK.
* To use register names with standard convension, please use CPU4_BLK2_OMASK.
*/
#define CPU4_OMASK2 (CPU4_BLK2_OMASK)

/** \brief FB34, CPUx Redirected Address Base Register 3 */
#define CPU4_BLK3_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB34u)
/** Alias (User Manual Name) for CPU4_BLK3_RABR.
* To use register names with standard convension, please use CPU4_BLK3_RABR.
*/
#define CPU4_RABR3 (CPU4_BLK3_RABR)

/** \brief FB38, CPUx Overlay Target Address Register 3 */
#define CPU4_BLK3_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB38u)
/** Alias (User Manual Name) for CPU4_BLK3_OTAR.
* To use register names with standard convension, please use CPU4_BLK3_OTAR.
*/
#define CPU4_OTAR3 (CPU4_BLK3_OTAR)

/** \brief FB3C, CPUx Overlay Mask Register 3 */
#define CPU4_BLK3_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB3Cu)
/** Alias (User Manual Name) for CPU4_BLK3_OMASK.
* To use register names with standard convension, please use CPU4_BLK3_OMASK.
*/
#define CPU4_OMASK3 (CPU4_BLK3_OMASK)

/** \brief FB40, CPUx Redirected Address Base Register 4 */
#define CPU4_BLK4_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB40u)
/** Alias (User Manual Name) for CPU4_BLK4_RABR.
* To use register names with standard convension, please use CPU4_BLK4_RABR.
*/
#define CPU4_RABR4 (CPU4_BLK4_RABR)

/** \brief FB44, CPUx Overlay Target Address Register 4 */
#define CPU4_BLK4_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB44u)
/** Alias (User Manual Name) for CPU4_BLK4_OTAR.
* To use register names with standard convension, please use CPU4_BLK4_OTAR.
*/
#define CPU4_OTAR4 (CPU4_BLK4_OTAR)

/** \brief FB48, CPUx Overlay Mask Register 4 */
#define CPU4_BLK4_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB48u)
/** Alias (User Manual Name) for CPU4_BLK4_OMASK.
* To use register names with standard convension, please use CPU4_BLK4_OMASK.
*/
#define CPU4_OMASK4 (CPU4_BLK4_OMASK)

