zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief FB4C, CPUx Redirected Address Base Register 5 */
#define CPU4_BLK5_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB4Cu)
/** Alias (User Manual Name) for CPU4_BLK5_RABR.
* To use register names with standard convension, please use CPU4_BLK5_RABR.
*/
#define CPU4_RABR5 (CPU4_BLK5_RABR)

/** \brief FB50, CPUx Overlay Target Address Register 5 */
#define CPU4_BLK5_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB50u)
/** Alias (User Manual Name) for CPU4_BLK5_OTAR.
* To use register names with standard convension, please use CPU4_BLK5_OTAR.
*/
#define CPU4_OTAR5 (CPU4_BLK5_OTAR)

/** \brief FB54, CPUx Overlay Mask Register 5 */
#define CPU4_BLK5_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB54u)
/** Alias (User Manual Name) for CPU4_BLK5_OMASK.
* To use register names with standard convension, please use CPU4_BLK5_OMASK.
*/
#define CPU4_OMASK5 (CPU4_BLK5_OMASK)

/** \brief FB58, CPUx Redirected Address Base Register 6 */
#define CPU4_BLK6_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB58u)
/** Alias (User Manual Name) for CPU4_BLK6_RABR.
* To use register names with standard convension, please use CPU4_BLK6_RABR.
*/
#define CPU4_RABR6 (CPU4_BLK6_RABR)

/** \brief FB5C, CPUx Overlay Target Address Register 6 */
#define CPU4_BLK6_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB5Cu)
/** Alias (User Manual Name) for CPU4_BLK6_OTAR.
* To use register names with standard convension, please use CPU4_BLK6_OTAR.
*/
#define CPU4_OTAR6 (CPU4_BLK6_OTAR)

/** \brief FB60, CPUx Overlay Mask Register 6 */
#define CPU4_BLK6_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB60u)
/** Alias (User Manual Name) for CPU4_BLK6_OMASK.
* To use register names with standard convension, please use CPU4_BLK6_OMASK.
*/
#define CPU4_OMASK6 (CPU4_BLK6_OMASK)

/** \brief FB64, CPUx Redirected Address Base Register 7 */
#define CPU4_BLK7_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB64u)
/** Alias (User Manual Name) for CPU4_BLK7_RABR.
* To use register names with standard convension, please use CPU4_BLK7_RABR.
*/
#define CPU4_RABR7 (CPU4_BLK7_RABR)

/** \brief FB68, CPUx Overlay Target Address Register 7 */
#define CPU4_BLK7_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB68u)
/** Alias (User Manual Name) for CPU4_BLK7_OTAR.
* To use register names with standard convension, please use CPU4_BLK7_OTAR.
*/
#define CPU4_OTAR7 (CPU4_BLK7_OTAR)

/** \brief FB6C, CPUx Overlay Mask Register 7 */
#define CPU4_BLK7_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB6Cu)
/** Alias (User Manual Name) for CPU4_BLK7_OMASK.
* To use register names with standard convension, please use CPU4_BLK7_OMASK.
*/
#define CPU4_OMASK7 (CPU4_BLK7_OMASK)

/** \brief FB70, CPUx Redirected Address Base Register 8 */
#define CPU4_BLK8_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB70u)
/** Alias (User Manual Name) for CPU4_BLK8_RABR.
* To use register names with standard convension, please use CPU4_BLK8_RABR.
*/
#define CPU4_RABR8 (CPU4_BLK8_RABR)

/** \brief FB74, CPUx Overlay Target Address Register 8 */
#define CPU4_BLK8_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB74u)
/** Alias (User Manual Name) for CPU4_BLK8_OTAR.
* To use register names with standard convension, please use CPU4_BLK8_OTAR.
*/
#define CPU4_OTAR8 (CPU4_BLK8_OTAR)

/** \brief FB78, CPUx Overlay Mask Register 8 */
#define CPU4_BLK8_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB78u)
/** Alias (User Manual Name) for CPU4_BLK8_OMASK.
* To use register names with standard convension, please use CPU4_BLK8_OMASK.
*/
#define CPU4_OMASK8 (CPU4_BLK8_OMASK)

/** \brief FB7C, CPUx Redirected Address Base Register 9 */
#define CPU4_BLK9_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB7Cu)
/** Alias (User Manual Name) for CPU4_BLK9_RABR.
* To use register names with standard convension, please use CPU4_BLK9_RABR.
*/
#define CPU4_RABR9 (CPU4_BLK9_RABR)

/** \brief FB80, CPUx Overlay Target Address Register 9 */
#define CPU4_BLK9_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB80u)
/** Alias (User Manual Name) for CPU4_BLK9_OTAR.
* To use register names with standard convension, please use CPU4_BLK9_OTAR.
*/
#define CPU4_OTAR9 (CPU4_BLK9_OTAR)

/** \brief FB84, CPUx Overlay Mask Register 9 */
#define CPU4_BLK9_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB84u)
/** Alias (User Manual Name) for CPU4_BLK9_OMASK.
* To use register names with standard convension, please use CPU4_BLK9_OMASK.
*/
#define CPU4_OMASK9 (CPU4_BLK9_OMASK)

/** \brief FB88, CPUx Redirected Address Base Register 10 */
#define CPU4_BLK10_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB88u)
/** Alias (User Manual Name) for CPU4_BLK10_RABR.
* To use register names with standard convension, please use CPU4_BLK10_RABR.
*/
#define CPU4_RABR10 (CPU4_BLK10_RABR)

/** \brief FB8C, CPUx Overlay Target Address Register 10 */
#define CPU4_BLK10_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB8Cu)
/** Alias (User Manual Name) for CPU4_BLK10_OTAR.
* To use register names with standard convension, please use CPU4_BLK10_OTAR.
*/
#define CPU4_OTAR10 (CPU4_BLK10_OTAR)

/** \brief FB90, CPUx Overlay Mask Register 10 */
#define CPU4_BLK10_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB90u)
/** Alias (User Manual Name) for CPU4_BLK10_OMASK.
* To use register names with standard convension, please use CPU4_BLK10_OMASK.
*/
#define CPU4_OMASK10 (CPU4_BLK10_OMASK)

/** \brief FB94, CPUx Redirected Address Base Register 11 */
#define CPU4_BLK11_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FB94u)
/** Alias (User Manual Name) for CPU4_BLK11_RABR.
* To use register names with standard convension, please use CPU4_BLK11_RABR.
*/
#define CPU4_RABR11 (CPU4_BLK11_RABR)

/** \brief FB98, CPUx Overlay Target Address Register 11 */
#define CPU4_BLK11_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FB98u)
/** Alias (User Manual Name) for CPU4_BLK11_OTAR.
* To use register names with standard convension, please use CPU4_BLK11_OTAR.
*/
#define CPU4_OTAR11 (CPU4_BLK11_OTAR)

/** \brief FB9C, CPUx Overlay Mask Register 11 */
#define CPU4_BLK11_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FB9Cu)
/** Alias (User Manual Name) for CPU4_BLK11_OMASK.
* To use register names with standard convension, please use CPU4_BLK11_OMASK.
*/
#define CPU4_OMASK11 (CPU4_BLK11_OMASK)

/** \brief FBA0, CPUx Redirected Address Base Register 12 */
#define CPU4_BLK12_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FBA0u)
/** Alias (User Manual Name) for CPU4_BLK12_RABR.
* To use register names with standard convension, please use CPU4_BLK12_RABR.
*/
#define CPU4_RABR12 (CPU4_BLK12_RABR)

/** \brief FBA4, CPUx Overlay Target Address Register 12 */
#define CPU4_BLK12_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FBA4u)
/** Alias (User Manual Name) for CPU4_BLK12_OTAR.
* To use register names with standard convension, please use CPU4_BLK12_OTAR.
*/
#define CPU4_OTAR12 (CPU4_BLK12_OTAR)

/** \brief FBA8, CPUx Overlay Mask Register 12 */
#define CPU4_BLK12_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FBA8u)
/** Alias (User Manual Name) for CPU4_BLK12_OMASK.
* To use register names with standard convension, please use CPU4_BLK12_OMASK.
*/
#define CPU4_OMASK12 (CPU4_BLK12_OMASK)

/** \brief FBAC, CPUx Redirected Address Base Register 13 */
#define CPU4_BLK13_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FBACu)
/** Alias (User Manual Name) for CPU4_BLK13_RABR.
* To use register names with standard convension, please use CPU4_BLK13_RABR.
*/
#define CPU4_RABR13 (CPU4_BLK13_RABR)

/** \brief FBB0, CPUx Overlay Target Address Register 13 */
#define CPU4_BLK13_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FBB0u)
/** Alias (User Manual Name) for CPU4_BLK13_OTAR.
* To use register names with standard convension, please use CPU4_BLK13_OTAR.
*/
#define CPU4_OTAR13 (CPU4_BLK13_OTAR)

/** \brief FBB4, CPUx Overlay Mask Register 13 */
#define CPU4_BLK13_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FBB4u)
/** Alias (User Manual Name) for CPU4_BLK13_OMASK.
* To use register names with standard convension, please use CPU4_BLK13_OMASK.
*/
#define CPU4_OMASK13 (CPU4_BLK13_OMASK)

/** \brief FBB8, CPUx Redirected Address Base Register 14 */
#define CPU4_BLK14_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FBB8u)
/** Alias (User Manual Name) for CPU4_BLK14_RABR.
* To use register names with standard convension, please use CPU4_BLK14_RABR.
*/
#define CPU4_RABR14 (CPU4_BLK14_RABR)

/** \brief FBBC, CPUx Overlay Target Address Register 14 */
#define CPU4_BLK14_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FBBCu)
/** Alias (User Manual Name) for CPU4_BLK14_OTAR.
* To use register names with standard convension, please use CPU4_BLK14_OTAR.
*/
#define CPU4_OTAR14 (CPU4_BLK14_OTAR)

/** \brief FBC0, CPUx Overlay Mask Register 14 */
#define CPU4_BLK14_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FBC0u)
/** Alias (User Manual Name) for CPU4_BLK14_OMASK.
* To use register names with standard convension, please use CPU4_BLK14_OMASK.
*/
#define CPU4_OMASK14 (CPU4_BLK14_OMASK)

/** \brief FBC4, CPUx Redirected Address Base Register 15 */
#define CPU4_BLK15_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FBC4u)
/** Alias (User Manual Name) for CPU4_BLK15_RABR.
* To use register names with standard convension, please use CPU4_BLK15_RABR.
*/
#define CPU4_RABR15 (CPU4_BLK15_RABR)

/** \brief FBC8, CPUx Overlay Target Address Register 15 */
#define CPU4_BLK15_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FBC8u)
/** Alias (User Manual Name) for CPU4_BLK15_OTAR.
* To use register names with standard convension, please use CPU4_BLK15_OTAR.
*/
#define CPU4_OTAR15 (CPU4_BLK15_OTAR)

/** \brief FBCC, CPUx Overlay Mask Register 15 */
#define CPU4_BLK15_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FBCCu)
/** Alias (User Manual Name) for CPU4_BLK15_OMASK.
* To use register names with standard convension, please use CPU4_BLK15_OMASK.
*/
#define CPU4_OMASK15 (CPU4_BLK15_OMASK)

