zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief FC3C, CPUx Redirected Address Base Register 25 */
#define CPU4_BLK25_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FC3Cu)
/** Alias (User Manual Name) for CPU4_BLK25_RABR.
* To use register names with standard convension, please use CPU4_BLK25_RABR.
*/
#define CPU4_RABR25 (CPU4_BLK25_RABR)

/** \brief FC40, CPUx Overlay Target Address Register 25 */
#define CPU4_BLK25_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FC40u)
/** Alias (User Manual Name) for CPU4_BLK25_OTAR.
* To use register names with standard convension, please use CPU4_BLK25_OTAR.
*/
#define CPU4_OTAR25 (CPU4_BLK25_OTAR)

/** \brief FC44, CPUx Overlay Mask Register 25 */
#define CPU4_BLK25_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FC44u)
/** Alias (User Manual Name) for CPU4_BLK25_OMASK.
* To use register names with standard convension, please use CPU4_BLK25_OMASK.
*/
#define CPU4_OMASK25 (CPU4_BLK25_OMASK)

/** \brief FC48, CPUx Redirected Address Base Register 26 */
#define CPU4_BLK26_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FC48u)
/** Alias (User Manual Name) for CPU4_BLK26_RABR.
* To use register names with standard convension, please use CPU4_BLK26_RABR.
*/
#define CPU4_RABR26 (CPU4_BLK26_RABR)

/** \brief FC4C, CPUx Overlay Target Address Register 26 */
#define CPU4_BLK26_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FC4Cu)
/** Alias (User Manual Name) for CPU4_BLK26_OTAR.
* To use register names with standard convension, please use CPU4_BLK26_OTAR.
*/
#define CPU4_OTAR26 (CPU4_BLK26_OTAR)

/** \brief FC50, CPUx Overlay Mask Register 26 */
#define CPU4_BLK26_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FC50u)
/** Alias (User Manual Name) for CPU4_BLK26_OMASK.
* To use register names with standard convension, please use CPU4_BLK26_OMASK.
*/
#define CPU4_OMASK26 (CPU4_BLK26_OMASK)

/** \brief FC54, CPUx Redirected Address Base Register 27 */
#define CPU4_BLK27_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FC54u)
/** Alias (User Manual Name) for CPU4_BLK27_RABR.
* To use register names with standard convension, please use CPU4_BLK27_RABR.
*/
#define CPU4_RABR27 (CPU4_BLK27_RABR)

/** \brief FC58, CPUx Overlay Target Address Register 27 */
#define CPU4_BLK27_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FC58u)
/** Alias (User Manual Name) for CPU4_BLK27_OTAR.
* To use register names with standard convension, please use CPU4_BLK27_OTAR.
*/
#define CPU4_OTAR27 (CPU4_BLK27_OTAR)

/** \brief FC5C, CPUx Overlay Mask Register 27 */
#define CPU4_BLK27_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FC5Cu)
/** Alias (User Manual Name) for CPU4_BLK27_OMASK.
* To use register names with standard convension, please use CPU4_BLK27_OMASK.
*/
#define CPU4_OMASK27 (CPU4_BLK27_OMASK)

/** \brief FC60, CPUx Redirected Address Base Register 28 */
#define CPU4_BLK28_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FC60u)
/** Alias (User Manual Name) for CPU4_BLK28_RABR.
* To use register names with standard convension, please use CPU4_BLK28_RABR.
*/
#define CPU4_RABR28 (CPU4_BLK28_RABR)

/** \brief FC64, CPUx Overlay Target Address Register 28 */
#define CPU4_BLK28_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FC64u)
/** Alias (User Manual Name) for CPU4_BLK28_OTAR.
* To use register names with standard convension, please use CPU4_BLK28_OTAR.
*/
#define CPU4_OTAR28 (CPU4_BLK28_OTAR)

/** \brief FC68, CPUx Overlay Mask Register 28 */
#define CPU4_BLK28_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FC68u)
/** Alias (User Manual Name) for CPU4_BLK28_OMASK.
* To use register names with standard convension, please use CPU4_BLK28_OMASK.
*/
#define CPU4_OMASK28 (CPU4_BLK28_OMASK)

/** \brief FC6C, CPUx Redirected Address Base Register 29 */
#define CPU4_BLK29_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FC6Cu)
/** Alias (User Manual Name) for CPU4_BLK29_RABR.
* To use register names with standard convension, please use CPU4_BLK29_RABR.
*/
#define CPU4_RABR29 (CPU4_BLK29_RABR)

/** \brief FC70, CPUx Overlay Target Address Register 29 */
#define CPU4_BLK29_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FC70u)
/** Alias (User Manual Name) for CPU4_BLK29_OTAR.
* To use register names with standard convension, please use CPU4_BLK29_OTAR.
*/
#define CPU4_OTAR29 (CPU4_BLK29_OTAR)

/** \brief FC74, CPUx Overlay Mask Register 29 */
#define CPU4_BLK29_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FC74u)
/** Alias (User Manual Name) for CPU4_BLK29_OMASK.
* To use register names with standard convension, please use CPU4_BLK29_OMASK.
*/
#define CPU4_OMASK29 (CPU4_BLK29_OMASK)

/** \brief FC78, CPUx Redirected Address Base Register 30 */
#define CPU4_BLK30_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FC78u)
/** Alias (User Manual Name) for CPU4_BLK30_RABR.
* To use register names with standard convension, please use CPU4_BLK30_RABR.
*/
#define CPU4_RABR30 (CPU4_BLK30_RABR)

/** \brief FC7C, CPUx Overlay Target Address Register 30 */
#define CPU4_BLK30_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FC7Cu)
/** Alias (User Manual Name) for CPU4_BLK30_OTAR.
* To use register names with standard convension, please use CPU4_BLK30_OTAR.
*/
#define CPU4_OTAR30 (CPU4_BLK30_OTAR)

/** \brief FC80, CPUx Overlay Mask Register 30 */
#define CPU4_BLK30_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FC80u)
/** Alias (User Manual Name) for CPU4_BLK30_OMASK.
* To use register names with standard convension, please use CPU4_BLK30_OMASK.
*/
#define CPU4_OMASK30 (CPU4_BLK30_OMASK)

/** \brief FC84, CPUx Redirected Address Base Register 31 */
#define CPU4_BLK31_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF888FC84u)
/** Alias (User Manual Name) for CPU4_BLK31_RABR.
* To use register names with standard convension, please use CPU4_BLK31_RABR.
*/
#define CPU4_RABR31 (CPU4_BLK31_RABR)

/** \brief FC88, CPUx Overlay Target Address Register 31 */
#define CPU4_BLK31_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF888FC88u)
/** Alias (User Manual Name) for CPU4_BLK31_OTAR.
* To use register names with standard convension, please use CPU4_BLK31_OTAR.
*/
#define CPU4_OTAR31 (CPU4_BLK31_OTAR)

