zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief E010, CPUx Safety Protection SPR Region Lower Address Register 1 */
#define CPU5_RGN1_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF88CE010u)
/** Alias (User Manual Name) for CPU5_RGN1_LA.
* To use register names with standard convension, please use CPU5_RGN1_LA.
*/
#define CPU5_SPR_SPROT_RGNLA1 (CPU5_RGN1_LA)

/** \brief E014, CPUx Safety Protection SPR Region Upper Address Register 1 */
#define CPU5_RGN1_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF88CE014u)
/** Alias (User Manual Name) for CPU5_RGN1_UA.
* To use register names with standard convension, please use CPU5_RGN1_UA.
*/
#define CPU5_SPR_SPROT_RGNUA1 (CPU5_RGN1_UA)

/** \brief E018, CPUx Safety Protection SPR Region Write Access Enable Register A1 */
#define CPU5_RGN1_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF88CE018u)
/** Alias (User Manual Name) for CPU5_RGN1_ACCENA.
* To use register names with standard convension, please use CPU5_RGN1_ACCENA.
*/
#define CPU5_SPR_SPROT_RGNACCENA1_W (CPU5_RGN1_ACCENA)

/** \brief E01C, CPUx Safety Protection SPR Region Write Access Enable Register B1 */
#define CPU5_RGN1_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF88CE01Cu)
/** Alias (User Manual Name) for CPU5_RGN1_ACCENB.
* To use register names with standard convension, please use CPU5_RGN1_ACCENB.
*/
#define CPU5_SPR_SPROT_RGNACCENB1_W (CPU5_RGN1_ACCENB)

/** \brief E020, CPUx Safety Protection SPR Region Lower Address Register 2 */
#define CPU5_RGN2_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF88CE020u)
/** Alias (User Manual Name) for CPU5_RGN2_LA.
* To use register names with standard convension, please use CPU5_RGN2_LA.
*/
#define CPU5_SPR_SPROT_RGNLA2 (CPU5_RGN2_LA)

/** \brief E024, CPUx Safety Protection SPR Region Upper Address Register 2 */
#define CPU5_RGN2_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF88CE024u)
/** Alias (User Manual Name) for CPU5_RGN2_UA.
* To use register names with standard convension, please use CPU5_RGN2_UA.
*/
#define CPU5_SPR_SPROT_RGNUA2 (CPU5_RGN2_UA)

/** \brief E028, CPUx Safety Protection SPR Region Write Access Enable Register A2 */
#define CPU5_RGN2_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF88CE028u)
/** Alias (User Manual Name) for CPU5_RGN2_ACCENA.
* To use register names with standard convension, please use CPU5_RGN2_ACCENA.
*/
#define CPU5_SPR_SPROT_RGNACCENA2_W (CPU5_RGN2_ACCENA)

/** \brief E02C, CPUx Safety Protection SPR Region Write Access Enable Register B2 */
#define CPU5_RGN2_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF88CE02Cu)
/** Alias (User Manual Name) for CPU5_RGN2_ACCENB.
* To use register names with standard convension, please use CPU5_RGN2_ACCENB.
*/
#define CPU5_SPR_SPROT_RGNACCENB2_W (CPU5_RGN2_ACCENB)

/** \brief E030, CPUx Safety Protection SPR Region Lower Address Register 3 */
#define CPU5_RGN3_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF88CE030u)
/** Alias (User Manual Name) for CPU5_RGN3_LA.
* To use register names with standard convension, please use CPU5_RGN3_LA.
*/
#define CPU5_SPR_SPROT_RGNLA3 (CPU5_RGN3_LA)

/** \brief E034, CPUx Safety Protection SPR Region Upper Address Register 3 */
#define CPU5_RGN3_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF88CE034u)
/** Alias (User Manual Name) for CPU5_RGN3_UA.
* To use register names with standard convension, please use CPU5_RGN3_UA.
*/
#define CPU5_SPR_SPROT_RGNUA3 (CPU5_RGN3_UA)

/** \brief E038, CPUx Safety Protection SPR Region Write Access Enable Register A3 */
#define CPU5_RGN3_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF88CE038u)
/** Alias (User Manual Name) for CPU5_RGN3_ACCENA.
* To use register names with standard convension, please use CPU5_RGN3_ACCENA.
*/
#define CPU5_SPR_SPROT_RGNACCENA3_W (CPU5_RGN3_ACCENA)

/** \brief E03C, CPUx Safety Protection SPR Region Write Access Enable Register B3 */
#define CPU5_RGN3_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF88CE03Cu)
/** Alias (User Manual Name) for CPU5_RGN3_ACCENB.
* To use register names with standard convension, please use CPU5_RGN3_ACCENB.
*/
#define CPU5_SPR_SPROT_RGNACCENB3_W (CPU5_RGN3_ACCENB)

/** \brief E040, CPUx Safety Protection SPR Region Lower Address Register 4 */
#define CPU5_RGN4_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF88CE040u)
/** Alias (User Manual Name) for CPU5_RGN4_LA.
* To use register names with standard convension, please use CPU5_RGN4_LA.
*/
#define CPU5_SPR_SPROT_RGNLA4 (CPU5_RGN4_LA)

/** \brief E044, CPUx Safety Protection SPR Region Upper Address Register 4 */
#define CPU5_RGN4_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF88CE044u)
/** Alias (User Manual Name) for CPU5_RGN4_UA.
* To use register names with standard convension, please use CPU5_RGN4_UA.
*/
#define CPU5_SPR_SPROT_RGNUA4 (CPU5_RGN4_UA)

/** \brief E048, CPUx Safety Protection SPR Region Write Access Enable Register A4 */
#define CPU5_RGN4_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF88CE048u)
/** Alias (User Manual Name) for CPU5_RGN4_ACCENA.
* To use register names with standard convension, please use CPU5_RGN4_ACCENA.
*/
#define CPU5_SPR_SPROT_RGNACCENA4_W (CPU5_RGN4_ACCENA)

/** \brief E04C, CPUx Safety Protection SPR Region Write Access Enable Register B4 */
#define CPU5_RGN4_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF88CE04Cu)
/** Alias (User Manual Name) for CPU5_RGN4_ACCENB.
* To use register names with standard convension, please use CPU5_RGN4_ACCENB.
*/
#define CPU5_SPR_SPROT_RGNACCENB4_W (CPU5_RGN4_ACCENB)

/** \brief E050, CPUx Safety Protection SPR Region Lower Address Register 5 */
#define CPU5_RGN5_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF88CE050u)
/** Alias (User Manual Name) for CPU5_RGN5_LA.
* To use register names with standard convension, please use CPU5_RGN5_LA.
*/
#define CPU5_SPR_SPROT_RGNLA5 (CPU5_RGN5_LA)

/** \brief E054, CPUx Safety Protection SPR Region Upper Address Register 5 */
#define CPU5_RGN5_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF88CE054u)
/** Alias (User Manual Name) for CPU5_RGN5_UA.
* To use register names with standard convension, please use CPU5_RGN5_UA.
*/
#define CPU5_SPR_SPROT_RGNUA5 (CPU5_RGN5_UA)

/** \brief E058, CPUx Safety Protection SPR Region Write Access Enable Register A5 */
#define CPU5_RGN5_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF88CE058u)
/** Alias (User Manual Name) for CPU5_RGN5_ACCENA.
* To use register names with standard convension, please use CPU5_RGN5_ACCENA.
*/
#define CPU5_SPR_SPROT_RGNACCENA5_W (CPU5_RGN5_ACCENA)

/** \brief E05C, CPUx Safety Protection SPR Region Write Access Enable Register B5 */
#define CPU5_RGN5_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF88CE05Cu)
/** Alias (User Manual Name) for CPU5_RGN5_ACCENB.
* To use register names with standard convension, please use CPU5_RGN5_ACCENB.
*/
#define CPU5_SPR_SPROT_RGNACCENB5_W (CPU5_RGN5_ACCENB)

/** \brief E060, CPUx Safety Protection SPR Region Lower Address Register 6 */
#define CPU5_RGN6_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF88CE060u)
/** Alias (User Manual Name) for CPU5_RGN6_LA.
* To use register names with standard convension, please use CPU5_RGN6_LA.
*/
#define CPU5_SPR_SPROT_RGNLA6 (CPU5_RGN6_LA)

/** \brief E064, CPUx Safety Protection SPR Region Upper Address Register 6 */
#define CPU5_RGN6_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF88CE064u)
/** Alias (User Manual Name) for CPU5_RGN6_UA.
* To use register names with standard convension, please use CPU5_RGN6_UA.
*/
#define CPU5_SPR_SPROT_RGNUA6 (CPU5_RGN6_UA)

