zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief E0EC, CPUx Safety Protection SPR Region Read Access Enable Register B6 */
#define CPU5_SPR_SPROT_RGNACCENB_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF88CE0ECu)
/** Alias (User Manual Name) for CPU5_SPR_SPROT_RGNACCENB_R6.
* To use register names with standard convension, please use CPU5_SPR_SPROT_RGNACCENB_R6.
*/
#define CPU5_SPR_SPROT_RGNACCENB6_R (CPU5_SPR_SPROT_RGNACCENB_R6)

/** \brief E0F8, CPUx Safety Protection SPR Region Read Access Enable Register A7 */
#define CPU5_SPR_SPROT_RGNACCENA_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA_R*)0xF88CE0F8u)
/** Alias (User Manual Name) for CPU5_SPR_SPROT_RGNACCENA_R7.
* To use register names with standard convension, please use CPU5_SPR_SPROT_RGNACCENA_R7.
*/
#define CPU5_SPR_SPROT_RGNACCENA7_R (CPU5_SPR_SPROT_RGNACCENA_R7)

/** \brief E0FC, CPUx Safety Protection SPR Region Read Access Enable Register B7 */
#define CPU5_SPR_SPROT_RGNACCENB_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF88CE0FCu)
/** Alias (User Manual Name) for CPU5_SPR_SPROT_RGNACCENB_R7.
* To use register names with standard convension, please use CPU5_SPR_SPROT_RGNACCENB_R7.
*/
#define CPU5_SPR_SPROT_RGNACCENB7_R (CPU5_SPR_SPROT_RGNACCENB_R7)

/** \brief E100, CPUx Safety Protection Register Access Enable Register A */
#define CPU5_SFR_SPROT_ACCENA_W /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SFR_SPROT_ACCENA_W*)0xF88CE100u)

/** \brief E104, CPUx Safety Protection Region Access Enable Register B */
#define CPU5_SFR_SPROT_ACCENB_W /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SFR_SPROT_ACCENB_W*)0xF88CE104u)

/** \brief E110, CPUx Safety Protection Region LPB Read Access Enable Register A */
#define CPU5_LPB_SPROT_ACCENA_R /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENA_R*)0xF88CE110u)

/** \brief E114, CPUx Safety Protection Region LPB Read Access Enable Register B */
#define CPU5_LPB_SPROT_ACCENB_R /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENB_R*)0xF88CE114u)

/** \brief E200, CPUx Safety Protection DLMU Region Lower Address Register 0 */
#define CPU5_DLMU_SPROT_RGNLA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF88CE200u)

/** \brief E204, CPUx Safety protection DLMU Region Upper Address Register 0 */
#define CPU5_DLMU_SPROT_RGNUA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF88CE204u)

/** \brief E208, CPUx Safety Protection Region DLMU Write Access Enable Register A0 */
#define CPU5_DLMU_SPROT_RGNACCENA_W0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF88CE208u)
/** Alias (User Manual Name) for CPU5_DLMU_SPROT_RGNACCENA_W0.
* To use register names with standard convension, please use CPU5_DLMU_SPROT_RGNACCENA_W0.
*/
#define CPU5_DLMU_SPROT_RGNACCENA0_W (CPU5_DLMU_SPROT_RGNACCENA_W0)

/** \brief E20C, CPUx Safety Protection Region DLMU Write Access Enable Register B0 */
#define CPU5_DLMU_SPROT_RGNACCENB_W0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF88CE20Cu)
/** Alias (User Manual Name) for CPU5_DLMU_SPROT_RGNACCENB_W0.
* To use register names with standard convension, please use CPU5_DLMU_SPROT_RGNACCENB_W0.
*/
#define CPU5_DLMU_SPROT_RGNACCENB0_W (CPU5_DLMU_SPROT_RGNACCENB_W0)

/** \brief E210, CPUx Safety Protection DLMU Region Lower Address Register 1 */
#define CPU5_DLMU_SPROT_RGNLA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF88CE210u)

/** \brief E214, CPUx Safety protection DLMU Region Upper Address Register 1 */
#define CPU5_DLMU_SPROT_RGNUA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF88CE214u)

/** \brief E218, CPUx Safety Protection Region DLMU Write Access Enable Register A1 */
#define CPU5_DLMU_SPROT_RGNACCENA_W1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF88CE218u)
/** Alias (User Manual Name) for CPU5_DLMU_SPROT_RGNACCENA_W1.
* To use register names with standard convension, please use CPU5_DLMU_SPROT_RGNACCENA_W1.
*/
#define CPU5_DLMU_SPROT_RGNACCENA1_W (CPU5_DLMU_SPROT_RGNACCENA_W1)

/** \brief E21C, CPUx Safety Protection Region DLMU Write Access Enable Register B1 */
#define CPU5_DLMU_SPROT_RGNACCENB_W1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF88CE21Cu)
/** Alias (User Manual Name) for CPU5_DLMU_SPROT_RGNACCENB_W1.
* To use register names with standard convension, please use CPU5_DLMU_SPROT_RGNACCENB_W1.
*/
#define CPU5_DLMU_SPROT_RGNACCENB1_W (CPU5_DLMU_SPROT_RGNACCENB_W1)

/** \brief E220, CPUx Safety Protection DLMU Region Lower Address Register 2 */
#define CPU5_DLMU_SPROT_RGNLA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF88CE220u)

/** \brief E224, CPUx Safety protection DLMU Region Upper Address Register 2 */
#define CPU5_DLMU_SPROT_RGNUA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF88CE224u)

/** \brief E228, CPUx Safety Protection Region DLMU Write Access Enable Register A2 */
#define CPU5_DLMU_SPROT_RGNACCENA_W2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF88CE228u)
/** Alias (User Manual Name) for CPU5_DLMU_SPROT_RGNACCENA_W2.
* To use register names with standard convension, please use CPU5_DLMU_SPROT_RGNACCENA_W2.
*/
#define CPU5_DLMU_SPROT_RGNACCENA2_W (CPU5_DLMU_SPROT_RGNACCENA_W2)

/** \brief E22C, CPUx Safety Protection Region DLMU Write Access Enable Register B2 */
#define CPU5_DLMU_SPROT_RGNACCENB_W2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF88CE22Cu)
/** Alias (User Manual Name) for CPU5_DLMU_SPROT_RGNACCENB_W2.
* To use register names with standard convension, please use CPU5_DLMU_SPROT_RGNACCENB_W2.
*/
#define CPU5_DLMU_SPROT_RGNACCENB2_W (CPU5_DLMU_SPROT_RGNACCENB_W2)

/** \brief E230, CPUx Safety Protection DLMU Region Lower Address Register 3 */
#define CPU5_DLMU_SPROT_RGNLA3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF88CE230u)

/** \brief E234, CPUx Safety protection DLMU Region Upper Address Register 3 */
#define CPU5_DLMU_SPROT_RGNUA3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF88CE234u)

/** \brief E238, CPUx Safety Protection Region DLMU Write Access Enable Register A3 */
#define CPU5_DLMU_SPROT_RGNACCENA_W3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF88CE238u)
/** Alias (User Manual Name) for CPU5_DLMU_SPROT_RGNACCENA_W3.
* To use register names with standard convension, please use CPU5_DLMU_SPROT_RGNACCENA_W3.
*/
#define CPU5_DLMU_SPROT_RGNACCENA3_W (CPU5_DLMU_SPROT_RGNACCENA_W3)

/** \brief E23C, CPUx Safety Protection Region DLMU Write Access Enable Register B3 */
#define CPU5_DLMU_SPROT_RGNACCENB_W3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF88CE23Cu)
/** Alias (User Manual Name) for CPU5_DLMU_SPROT_RGNACCENB_W3.
* To use register names with standard convension, please use CPU5_DLMU_SPROT_RGNACCENB_W3.
*/
#define CPU5_DLMU_SPROT_RGNACCENB3_W (CPU5_DLMU_SPROT_RGNACCENB_W3)

/** \brief E240, CPUx Safety Protection DLMU Region Lower Address Register 4 */
#define CPU5_DLMU_SPROT_RGNLA4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF88CE240u)

/** \brief E244, CPUx Safety protection DLMU Region Upper Address Register 4 */
#define CPU5_DLMU_SPROT_RGNUA4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF88CE244u)

/** \brief E248, CPUx Safety Protection Region DLMU Write Access Enable Register A4 */
#define CPU5_DLMU_SPROT_RGNACCENA_W4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF88CE248u)
/** Alias (User Manual Name) for CPU5_DLMU_SPROT_RGNACCENA_W4.
* To use register names with standard convension, please use CPU5_DLMU_SPROT_RGNACCENA_W4.
*/
#define CPU5_DLMU_SPROT_RGNACCENA4_W (CPU5_DLMU_SPROT_RGNACCENA_W4)

/** \brief E24C, CPUx Safety Protection Region DLMU Write Access Enable Register B4 */
#define CPU5_DLMU_SPROT_RGNACCENB_W4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF88CE24Cu)
/** Alias (User Manual Name) for CPU5_DLMU_SPROT_RGNACCENB_W4.
* To use register names with standard convension, please use CPU5_DLMU_SPROT_RGNACCENB_W4.
*/
#define CPU5_DLMU_SPROT_RGNACCENB4_W (CPU5_DLMU_SPROT_RGNACCENB_W4)

/** \brief E250, CPUx Safety Protection DLMU Region Lower Address Register 5 */
#define CPU5_DLMU_SPROT_RGNLA5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF88CE250u)

