zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief E004, CPUx Code Protection Execute Enable Register Set 1 */
#define CPU5_CPXE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF88DE004u)

/** \brief E008, CPUx Code Protection Execute Enable Register Set 2 */
#define CPU5_CPXE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF88DE008u)

/** \brief E00C, CPUx Code Protection Execute Enable Register Set 3 */
#define CPU5_CPXE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF88DE00Cu)

/** \brief E010, CPUx Data Protection Read Enable Register Set 0 */
#define CPU5_DPRE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF88DE010u)

/** \brief E014, CPUx Data Protection Read Enable Register Set 1 */
#define CPU5_DPRE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF88DE014u)

/** \brief E018, CPUx Data Protection Read Enable Register Set 2 */
#define CPU5_DPRE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF88DE018u)

/** \brief E01C, CPUx Data Protection Read Enable Register Set 3 */
#define CPU5_DPRE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF88DE01Cu)

/** \brief E020, CPUx Data Protection Write Enable Register Set 0 */
#define CPU5_DPWE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF88DE020u)

/** \brief E024, CPUx Data Protection Write Enable Register Set 1 */
#define CPU5_DPWE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF88DE024u)

/** \brief E028, CPUx Data Protection Write Enable Register Set 2 */
#define CPU5_DPWE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF88DE028u)

/** \brief E02C, CPUx Data Protection Write Enable Register Set 3 */
#define CPU5_DPWE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF88DE02Cu)

/** \brief E040, CPUx Code Protection Execute Enable Register Set 4 */
#define CPU5_CPXE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF88DE040u)

/** \brief E044, CPUx Code Protection Execute Enable Register Set 5 */
#define CPU5_CPXE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF88DE044u)

/** \brief E050, CPUx Data Protection Read Enable Register Set 4 */
#define CPU5_DPRE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF88DE050u)

/** \brief E054, CPUx Data Protection Read Enable Register Set 5 */
#define CPU5_DPRE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF88DE054u)

/** \brief E060, CPUx Data Protection Write Enable Register Set 4 */
#define CPU5_DPWE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF88DE060u)

/** \brief E064, CPUx Data Protection Write Enable Register Set 5 */
#define CPU5_DPWE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF88DE064u)

/** \brief E400, CPUx Temporal Protection System Control Register */
#define CPU5_TPS_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_CON*)0xF88DE400u)

/** \brief E404, CPUx Temporal Protection System Timer Register 0 */
#define CPU5_TPS_TIMER0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF88DE404u)

/** \brief E408, CPUx Temporal Protection System Timer Register 1 */
#define CPU5_TPS_TIMER1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF88DE408u)

/** \brief E40C, CPUx Temporal Protection System Timer Register 2 */
#define CPU5_TPS_TIMER2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF88DE40Cu)

/** \brief E440, CPUx Exception Entry Timer Load Value */
#define CPU5_TPS_EXTIM_ENTRY_LVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_ENTRY_LVAL*)0xF88DE440u)

/** \brief E444, CPUx Exception Entry Timer Current Value */
#define CPU5_TPS_EXTIM_ENTRY_CVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_ENTRY_CVAL*)0xF88DE444u)

/** \brief E448, CPUx Exception Exit  Timer Load Value */
#define CPU5_TPS_EXTIM_EXIT_LVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_EXIT_LVAL*)0xF88DE448u)

/** \brief E44C, CPUx Exception Exit Timer Current Value */
#define CPU5_TPS_EXTIM_EXIT_CVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_EXIT_CVAL*)0xF88DE44Cu)

/** \brief E450, CPUx Exception Timer Class Enable Register */
#define CPU5_TPS_EXTIM_CLASS_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_CLASS_EN*)0xF88DE450u)

/** \brief E454, CPUx Exception Timer Status Register */
#define CPU5_TPS_EXTIM_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_STAT*)0xF88DE454u)

/** \brief E458, CPUx Exception Timer FCX Register */
#define CPU5_TPS_EXTIM_FCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_FCX*)0xF88DE458u)

/** \brief F000, CPUx Trigger Event 0 */
#define CPU5_TR0_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF88DF000u)
/** Alias (User Manual Name) for CPU5_TR0_EVT.
* To use register names with standard convension, please use CPU5_TR0_EVT.
*/
#define CPU5_TR0EVT (CPU5_TR0_EVT)

/** \brief F004, CPUx Trigger Address 0 */
#define CPU5_TR0_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF88DF004u)
/** Alias (User Manual Name) for CPU5_TR0_ADR.
* To use register names with standard convension, please use CPU5_TR0_ADR.
*/
#define CPU5_TR0ADR (CPU5_TR0_ADR)

/** \brief F008, CPUx Trigger Event 1 */
#define CPU5_TR1_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF88DF008u)
/** Alias (User Manual Name) for CPU5_TR1_EVT.
* To use register names with standard convension, please use CPU5_TR1_EVT.
*/
#define CPU5_TR1EVT (CPU5_TR1_EVT)

/** \brief F00C, CPUx Trigger Address 1 */
#define CPU5_TR1_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF88DF00Cu)
/** Alias (User Manual Name) for CPU5_TR1_ADR.
* To use register names with standard convension, please use CPU5_TR1_ADR.
*/
#define CPU5_TR1ADR (CPU5_TR1_ADR)

/** \brief F010, CPUx Trigger Event 2 */
#define CPU5_TR2_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF88DF010u)
/** Alias (User Manual Name) for CPU5_TR2_EVT.
* To use register names with standard convension, please use CPU5_TR2_EVT.
*/
#define CPU5_TR2EVT (CPU5_TR2_EVT)

/** \brief F014, CPUx Trigger Address 2 */
#define CPU5_TR2_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF88DF014u)
/** Alias (User Manual Name) for CPU5_TR2_ADR.
* To use register names with standard convension, please use CPU5_TR2_ADR.
*/
#define CPU5_TR2ADR (CPU5_TR2_ADR)

