zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCpu_reg.h
/** \brief F018, CPUx Trigger Event 3 */
#define CPU5_TR3_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF88DF018u)
/** Alias (User Manual Name) for CPU5_TR3_EVT.
* To use register names with standard convension, please use CPU5_TR3_EVT.
*/
#define CPU5_TR3EVT (CPU5_TR3_EVT)

/** \brief F01C, CPUx Trigger Address 3 */
#define CPU5_TR3_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF88DF01Cu)
/** Alias (User Manual Name) for CPU5_TR3_ADR.
* To use register names with standard convension, please use CPU5_TR3_ADR.
*/
#define CPU5_TR3ADR (CPU5_TR3_ADR)

/** \brief F020, CPUx Trigger Event 4 */
#define CPU5_TR4_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF88DF020u)
/** Alias (User Manual Name) for CPU5_TR4_EVT.
* To use register names with standard convension, please use CPU5_TR4_EVT.
*/
#define CPU5_TR4EVT (CPU5_TR4_EVT)

/** \brief F024, CPUx Trigger Address 4 */
#define CPU5_TR4_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF88DF024u)
/** Alias (User Manual Name) for CPU5_TR4_ADR.
* To use register names with standard convension, please use CPU5_TR4_ADR.
*/
#define CPU5_TR4ADR (CPU5_TR4_ADR)

/** \brief F028, CPUx Trigger Event 5 */
#define CPU5_TR5_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF88DF028u)
/** Alias (User Manual Name) for CPU5_TR5_EVT.
* To use register names with standard convension, please use CPU5_TR5_EVT.
*/
#define CPU5_TR5EVT (CPU5_TR5_EVT)

/** \brief F02C, CPUx Trigger Address 5 */
#define CPU5_TR5_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF88DF02Cu)
/** Alias (User Manual Name) for CPU5_TR5_ADR.
* To use register names with standard convension, please use CPU5_TR5_ADR.
*/
#define CPU5_TR5ADR (CPU5_TR5_ADR)

/** \brief F030, CPUx Trigger Event 6 */
#define CPU5_TR6_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF88DF030u)
/** Alias (User Manual Name) for CPU5_TR6_EVT.
* To use register names with standard convension, please use CPU5_TR6_EVT.
*/
#define CPU5_TR6EVT (CPU5_TR6_EVT)

/** \brief F034, CPUx Trigger Address 6 */
#define CPU5_TR6_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF88DF034u)
/** Alias (User Manual Name) for CPU5_TR6_ADR.
* To use register names with standard convension, please use CPU5_TR6_ADR.
*/
#define CPU5_TR6ADR (CPU5_TR6_ADR)

/** \brief F038, CPUx Trigger Event 7 */
#define CPU5_TR7_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF88DF038u)
/** Alias (User Manual Name) for CPU5_TR7_EVT.
* To use register names with standard convension, please use CPU5_TR7_EVT.
*/
#define CPU5_TR7EVT (CPU5_TR7_EVT)

/** \brief F03C, CPUx Trigger Address 7 */
#define CPU5_TR7_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF88DF03Cu)
/** Alias (User Manual Name) for CPU5_TR7_ADR.
* To use register names with standard convension, please use CPU5_TR7_ADR.
*/
#define CPU5_TR7ADR (CPU5_TR7_ADR)

/** \brief FC00, CPUx Counter Control */
#define CPU5_CCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CCTRL*)0xF88DFC00u)

/** \brief FC04, CPUx CPU Clock Cycle Count */
#define CPU5_CCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CCNT*)0xF88DFC04u)

/** \brief FC08, CPUx Instruction Count */
#define CPU5_ICNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ICNT*)0xF88DFC08u)

/** \brief FC0C, CPUx Multi-Count Register 1 */
#define CPU5_M1CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M1CNT*)0xF88DFC0Cu)

/** \brief FC10, CPUx Multi-Count Register 2 */
#define CPU5_M2CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M2CNT*)0xF88DFC10u)

/** \brief FC14, CPUx Multi-Count Register 3 */
#define CPU5_M3CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M3CNT*)0xF88DFC14u)

/** \brief FD00, CPUx Debug Status Register */
#define CPU5_DBGSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DBGSR*)0xF88DFD00u)

/** \brief FD08, CPUx External Event Register */
#define CPU5_EXEVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_EXEVT*)0xF88DFD08u)

/** \brief FD0C, CPUx Core Register Access Event */
#define CPU5_CREVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CREVT*)0xF88DFD0Cu)

/** \brief FD10, CPUx Software Debug Event */
#define CPU5_SWEVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SWEVT*)0xF88DFD10u)

/** \brief FD30, CPUx TriggerAddressx */
#define CPU5_TRIG_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TRIG_ACC*)0xF88DFD30u)

/** \brief FD40, CPUx Debug Monitor Start Address */
#define CPU5_DMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DMS*)0xF88DFD40u)

/** \brief FD44, CPUx Debug Context Save Area Pointer */
#define CPU5_DCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DCX*)0xF88DFD44u)

/** \brief FD48, CPUx Debug Trap Control Register */
#define CPU5_DBGTCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF88DFD48u)

/** \brief FE00, CPUx Previous Context Information Register */
#define CPU5_PCXI /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCXI*)0xF88DFE00u)

/** \brief FE04, CPUx Program Status Word */
#define CPU5_PSW /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PSW*)0xF88DFE04u)

/** \brief FE08, CPUx Program Counter */
#define CPU5_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PC*)0xF88DFE08u)

/** \brief FE14, CPUx System Configuration Register */
#define CPU5_SYSCON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SYSCON*)0xF88DFE14u)

/** \brief FE18, CPUx Identification Register TC1.6.2P */
#define CPU5_CPU_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF88DFE18u)

/** \brief FE1C, CPUx Core Identification Register */
#define CPU5_CORE_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF88DFE1Cu)

/** \brief FE20, CPUx Base Interrupt Vector Table Pointer */
#define CPU5_BIV /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BIV*)0xF88DFE20u)

/** \brief FE24, CPUx Base Trap Vector Table Pointer */
#define CPU5_BTV /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BTV*)0xF88DFE24u)

/** \brief FE28, CPUx Interrupt Stack Pointer */
#define CPU5_ISP /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ISP*)0xF88DFE28u)

/** \brief FE2C, CPUx Interrupt Control Register */
#define CPU5_ICR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ICR*)0xF88DFE2Cu)

/** \brief FE38, CPUx Free CSA List Head Pointer */
#define CPU5_FCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FCX*)0xF88DFE38u)

/** \brief FE3C, CPUx Free CSA List Limit Pointer */
#define CPU5_LCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_LCX*)0xF88DFE3Cu)

/** \brief FE50, CPUx Customer ID register */
#define CPU5_CUS_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF88DFE50u)

/** \brief FF00, CPUx Data General Purpose Register 0 */
#define CPU5_D0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF00u)

